In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
titanic = sns. load_dataset('titanic')

In [7]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [8]:
missing_perc = titanic.isnull().mean()

In [9]:
missing_perc

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [4]:
df = titanic.copy()

In [5]:
# dropping all columns

# Calculate the percentage of missing values in each column
missing_percentages = df.isnull().sum() / len(df) * 100

# Define the threshold for dropping columns (80% or more missing values)
threshold = 80

# Get the column names that exceed the threshold
columns_to_drop = missing_percentages[missing_percentages >= threshold].index

# Drop the columns from the DataFrame
df_dropped = df.drop(columns_to_drop, axis=1)

In [6]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [10]:
# What is the mean fare?
titanic['fare'].mean()

32.2042079685746

In [11]:
df2 = titanic.copy()

In [12]:
#Pairwise deletions
df2.shape

(891, 15)

In [13]:
df2.dropna().shape

(182, 15)

In [14]:
891-182

709

In [16]:
# imputing constant 20 to age missing. values and. calculate mean
df3 = titanic.copy()
# Impute missing values with a constant (e.g., 0)
const = 20

In [18]:
imputed_df = df3['age'].fillna(const)

In [20]:
imputed_df.mean()

27.7723569023569

In [21]:
titanic['age'].mean()

29.69911764705882

In [27]:
titanic.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [28]:
177 + 2 + 688 +2

869

In [33]:
df5 = titanic.copy()

In [35]:
imputed_df = df5['age'].fillna(method='bfill')

In [37]:
imputed_df.mean()

29.87056116722783

In [38]:
imputed_df2 = df5['fare'].fillna(method='bfill')

In [39]:
imputed_df2.mean()

32.2042079685746

In [40]:
imputed_df3 = df5['fare'].fillna(method='ffill')

In [41]:
imputed_df3.mean()

32.2042079685746

In [42]:
df6 =  titanic.copy()

In [43]:
imputed_df6 = df['age'].fillna(df['age'].mean())

In [44]:
imputed_df6.mean()

29.699117647058763

In [45]:
imputed_df7 = df['fare'].fillna(20)

In [46]:
imputed_df7.mean()

32.2042079685746

In [47]:
imputed_df9 = df6['age'].fillna(method='ffill')

In [48]:
imputed_df9.mean()

29.581560044893376